_protected/frontend/controllers/MonitoringkacamataController.php

INSERT INTO `monitoring_kacamata` (`nikkes`, `hak_kacamata_id`, `tgl_ambil`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES ('340123.000', 2, '2016-01-11', NOW(), NOW(), 3, 3)
---
    public function actionCreate()
    {
        $model = new MonitoringKacamata();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `monitoring_kacamata` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = MonitoringKacamata::findOne($id)) !== null) {