_protected/frontend/controllers/PesertaController.php

SELECT * FROM `peserta` WHERE `nikkes`='340123.000'
---
    public function actionGetDataPeserta($nikkes)
    {
        $dataPeserta = Peserta::find()->where(['nikkes'=>$nikkes])->one();