_protected/frontend/controllers/PlafonkacamataController.php

    public function actionGetDataPlafon($hak_kacamata_id,$band = null ,$status_peserta_id = null)
    {
        $dataPlafon = PlafonKacamata::find()
        			->where(['hak_kacamata_id'=>$hak_kacamata_id])
        			->andWhere(['band'=>$band])
        			->andWhere(['status_peserta_id'=>$status_peserta_id])
        			->one();
---
SELECT * FROM `plafon_kacamata` WHERE ((`hak_kacamata_id`='2') AND (`band`='VII ')) AND (`status_peserta_id`='3')