_protected/frontend/models/MonitoringKacamata.php

    public function getHakKacamataList()
    {
        $dropOptions = \backend\models\HakKacamata::find()->asArray()->all();
---
SELECT * FROM `hak_kacamata`